// Look for Black Basta indicators
OfficeActivity
| where TimeGenerated > ago(90d)
| where OfficeWorkload =~ "MicrosoftTeams"
| where UserId has_any("onmicrosoft.com")
| where not(UserId has_any("snowflake","netrixllc","newengen","iqor","inspiro"))
| summarize count() by UserId