// Identify Common App Protocols for Palo TRAFFIC Ingestion :: 5/12/2024 RF
CommonSecurityLog
| where TimeGenerated > ago(7d)
| where Activity == "TRAFFIC" or Activity == "THREAT"
//| where Computer startswith "GTM" // Uncomment to specify host group. 
| summarize CountPerGroup = count() by ApplicationProtocol, Activity
| extend TotalCount = toscalar(Syslog | where TimeGenerated > ago(7d) | summarize count())
| extend Percentage = round((CountPerGroup * 100.0) / TotalCount, 2)
| where Percentage > 1
| order by Percentage desc