SecurityEvent  
| where EventID == '4732'
| where Account has_any ("auditor","liebermanZP1")
| extend MemberName = extract('<Data Name="MemberName">([^<]+)</Data>', 1, EventData)
| extend MemberSid = extract('<Data Name="MemberSid">([^<]+)</Data>', 1, EventData)
| extend TargetUserName = extract('<Data Name="TargetUserName">([^<]+)</Data>', 1, EventData)
| extend TargetDomainName = extract('<Data Name="TargetDomainName">([^<]+)</Data>', 1, EventData)
| extend TargetSid = extract('<Data Name="TargetSid">([^<]+)</Data>', 1, EventData)
| extend SubjectUserSid = extract('<Data Name="SubjectUserSid">([^<]+)</Data>', 1, EventData)
| extend SubjectUserName = extract('<Data Name="SubjectUserName">([^<]+)</Data>', 1, EventData)
| extend SubjectDomainName = extract('<Data Name="SubjectDomainName">([^<]+)</Data>', 1, EventData)
| extend SubjectLogonId = extract('<Data Name="SubjectLogonId">([^<]+)</Data>', 1, EventData)
| extend PrivilegeList = extract('<Data Name="PrivilegeList">([^<]+)</Data>', 1, EventData)
| project TimeGenerated, Type, EventID, Computer, EventSourceName, EventRecordId, Keywords, CategoryId, Activity, SubjectAccount, SubjectUserName, SubjectDomainName, SubjectLogonId, MemberSid, MemberName, TargetAccount,TargetUserName, TargetDomainName, PrivilegeList
| join kind=leftouter (
    IdentityInfo
    | project AccountSID, AccountUPN
) on $left.MemberSid == $right.AccountSID
| project TimeGenerated, Type, EventID, Computer, EventSourceName, EventRecordId, Keywords, CategoryId, Activity, SubjectAccount, SubjectUserName, SubjectDomainName, SubjectLogonId, MemberSid, AccountUPN, AccountSID, TargetAccount, TargetUserName, TargetDomainName, PrivilegeList