{
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workbookDisplayName": {
      "type": "string",
      "defaultValue": "Brivo Event Log Workbook",
      "metadata": {
        "description": "The friendly name for the workbook that is used in the Gallery or Saved List. This name must be unique within a resource group."
      }
    },
    "workbookType": {
      "type": "string",
      "defaultValue": "sentinel",
      "metadata": {
        "description": "The gallery that the workbook will be shown under. Supported values include workbook, tsg, etc. Usually, this is 'workbook'."
      }
    },
    "workbookSourceId": {
      "type": "string",
      "defaultValue": "/subscriptions/<SUBSCRIPTION-ID>/resourcegroups/<RESOURCE-GROUP>/providers/microsoft.operationalinsights/workspaces/<WORKSPACE-NAME>",
      "metadata": {
        "description": "The id of resource instance to which the workbook will be associated."
      }
    },
    "workbookId": {
      "type": "string",
      "defaultValue": "<WORKBOOK-GUID>",
      "metadata": {
        "description": "The unique guid for this workbook instance."
      }
    }
  },
  "resources": [
    {
      "name": "[parameters('workbookId')]",
      "type": "microsoft.insights/workbooks",
      "location": "[resourceGroup().location]",
      "apiVersion": "2022-04-01",
      "dependsOn": [],
      "kind": "shared",
      "properties": {
        "displayName": "[parameters('workbookDisplayName')]",
        "serializedData": "{\"version\":\"Notebook/1.0\",\"items\":[{\"type\":9,\"content\":{\"version\":\"KqlParameterItem/1.0\",\"parameters\":[{\"id\":\"a5c18655-3e2d-4d12-8ba4-82e57b296581\",\"version\":\"KqlParameterItem/1.0\",\"name\":\"TimeRange\",\"type\":4,\"isRequired\":true,\"value\":{\"durationMs\":43200000},\"typeSettings\":{\"selectableValues\":[{\"durationMs\":300000},{\"durationMs\":900000},{\"durationMs\":1800000},{\"durationMs\":3600000},{\"durationMs\":14400000},{\"durationMs\":43200000},{\"durationMs\":86400000},{\"durationMs\":172800000},{\"durationMs\":259200000},{\"durationMs\":604800000},{\"durationMs\":1209600000},{\"durationMs\":2419200000},{\"durationMs\":2592000000},{\"durationMs\":5184000000},{\"durationMs\":7776000000}],\"allowCustom\":true}},{\"id\":\"7d6f426d-e03a-4bbb-ad7e-25d3199d0a3b\",\"version\":\"KqlParameterItem/1.0\",\"name\":\"EmployeeName\",\"label\":\"Employee Name\",\"type\":2,\"description\":\"Choose employee name.\",\"isRequired\":true,\"multiSelect\":true,\"quote\":\"'\",\"delimiter\":\",\",\"query\":\"BrivoEvents_CL\\n| distinct actor_name_s\\n| order by actor_name_s asc\",\"typeSettings\":{\"additionalResourceOptions\":[\"value::all\"],\"selectAllValue\":\"All\",\"showDefault\":false},\"timeContext\":{\"durationMs\":0},\"timeContextFromParameter\":\"TimeRange\",\"defaultValue\":\"value::all\",\"queryType\":0,\"resourceType\":\"microsoft.operationalinsights/workspaces\",\"value\":[\"value::all\"]},{\"id\":\"46f01547-1691-4c03-936a-90494efc22d3\",\"version\":\"KqlParameterItem/1.0\",\"name\":\"SiteName\",\"label\":\"Site Name\",\"type\":2,\"description\":\"Choose site names\",\"isRequired\":true,\"multiSelect\":true,\"quote\":\"'\",\"delimiter\":\",\",\"query\":\"BrivoEvents_CL\\n| where TimeGenerated > ago(7d)\\n| distinct site_name_s\\n| order by site_name_s asc\",\"typeSettings\":{\"additionalResourceOptions\":[\"value::all\"],\"selectAllValue\":\"All\",\"showDefault\":false},\"defaultValue\":\"value::all\",\"queryType\":0,\"resourceType\":\"microsoft.operationalinsights/workspaces\",\"value\":[\"value::all\"]}],\"style\":\"pills\",\"queryType\":0,\"resourceType\":\"microsoft.operationalinsights/workspaces\"},\"name\":\"parameters - 5\"},{\"type\":3,\"content\":{\"version\":\"KqlItem/1.0\",\"query\":\"BrivoEvents_CL\\n| where '{EmployeeName:lable}' == 'All' or actor_name_s in ({EmployeeName})\\n| where '{SiteName:lable}' == 'All' or site_name_s in ({SiteName})\\n| extend RawEmployeeNumber = coalesce(empid_s, medeeid_s, 'missing')\\n| extend EmployeeNumber = iif(RawEmployeeNumber == 'missing','missing',substring(strcat('000000', tostring(RawEmployeeNumber)),-6,6))\\n| join kind=leftouter (\\n    IdentityInfo\\n    | where TimeGenerated > ago(90d)\\n    | extend EmployeeNumber = substring(strcat('000000', tostring(EmployeeId)),-6,6)\\n    | summarize arg_max(TimeGenerated, *) by EmployeeNumber\\n    | project EmployeeNumber, AccountUPN, AccountDisplayName\\n) on EmployeeNumber\\n| project Timestamp = timestamp_t, EmployeeNumber, EmployeeName = actor_name_s, Site = site_name_s, Door = door_name_s, Result = result_s, Email = AccountUPN, AccountName = AccountDisplayName\\n| order by Timestamp desc\\n| summarize EventCount = count() by Site, bin(Timestamp, 5m)\\n| render timechart\",\"size\":1,\"title\":\"Events by Site\",\"timeContextFromParameter\":\"TimeRange\",\"queryType\":0,\"resourceType\":\"microsoft.operationalinsights/workspaces\",\"visualization\":\"timechart\",\"chartSettings\":{\"showLegend\":true}},\"name\":\"query - 2\"},{\"type\":3,\"content\":{\"version\":\"KqlItem/1.0\",\"query\":\"BrivoEvents_CL\\n| where '{EmployeeName:lable}' == 'All' or actor_name_s in ({EmployeeName})\\n| where '{SiteName:lable}' == 'All' or site_name_s in ({SiteName})\\n| extend RawEmployeeNumber = coalesce(empid_s, medeeid_s, 'missing')\\n| extend EmployeeNumber = iif(RawEmployeeNumber == 'missing','missing',substring(strcat('000000', tostring(RawEmployeeNumber)),-6,6))\\n| join kind=leftouter (\\n    IdentityInfo\\n    | where TimeGenerated > ago(90d)\\n    | extend EmployeeNumber = substring(strcat('000000', tostring(EmployeeId)),-6,6)\\n    | summarize arg_max(TimeGenerated, *) by EmployeeNumber\\n    | project EmployeeNumber, AccountUPN, AccountDisplayName\\n) on EmployeeNumber\\n| project Timestamp = timestamp_t, EmployeeNumber, EmployeeName = actor_name_s, Site = site_name_s, Door = door_name_s, Result = result_s, Email = AccountUPN, AccountName = AccountDisplayName\\n| order by Timestamp desc\",\"size\":2,\"showAnalytics\":true,\"title\":\"Brivo Access Events\",\"showRefreshButton\":true,\"showExportToExcel\":true,\"queryType\":0,\"resourceType\":\"microsoft.operationalinsights/workspaces\",\"gridSettings\":{\"rowLimit\":10000,\"filter\":true}},\"name\":\"Brivo Access Events\"},{\"type\":3,\"content\":{\"version\":\"KqlItem/1.0\",\"query\":\"// Monthly Attendance based on Brivo Badge Events\\nlet today = startofday(now());\\nlet startTime = startofmonth(today);\\nlet endTime = startofmonth(startTime + 32d);\\nlet numDays = datetime_diff('day', endTime, startTime);\\nlet ignorenames = dynamic(['contractor','first step','vending','cleaners','temporary','crown','employee']);\\nlet ignoreids = dynamic(['CONSULTANT','TEMP','ULTANT','UNTEER','RACTOR','CURITY','farms','00TEMP']);\\nlet ignoreemails = dynamic(['iqo-','spi-','krbtgt']);\\nlet CalendarDays = range Day from 1 to 31 step 1 | extend Date = startTime + (Day - 1) * 1d;\\nlet baseData = BrivoEvents_CL\\n| where TimeGenerated between (startTime .. endTime)\\n| extend UserId = tostring(user_id_s), Day = datetime_diff('day', TimeGenerated, startTime) + 1\\n| where Day between (1 .. 31)\\n| summarize Present = count(), DisplayName = any(actor_name_s) by UserId, Day\\n| extend Present = 1;\\nlet peopleList = BrivoEvents_CL\\n| where TimeGenerated between (startTime .. endTime)\\n| summarize DisplayName = any(actor_name_s) by UserId = tostring(user_id_s)\\n| extend join_key = 1;\\nlet allDays = CalendarDays | extend join_key = 1;\\nlet fullMatrix = peopleList | join kind=inner (allDays) on join_key | project UserId, DisplayName, Day;\\nlet padded = fullMatrix | join kind=leftouter (baseData) on UserId, Day | extend Present = coalesce(Present,0);\\nlet withTallies = padded | summarize Day1=maxif(Present,Day==1), Day2=maxif(Present,Day==2), Day3=maxif(Present,Day==3), Day4=maxif(Present,Day==4), Day5=maxif(Present,Day==5), Day6=maxif(Present,Day==6), Day7=maxif(Present,Day==7), Day8=maxif(Present,Day==8), Day9=maxif(Present,Day==9), Day10=maxif(Present,Day==10), Day11=maxif(Present,Day==11), Day12=maxif(Present,Day==12), Day13=maxif(Present,Day==13), Day14=maxif(Present,Day==14), Day15=maxif(Present,Day==15), Day16=maxif(Present,Day==16), Day17=maxif(Present,Day==17), Day18=maxif(Present,Day==18), Day19=maxif(Present,Day==19), Day20=maxif(Present,Day==20), Day21=maxif(Present,Day==21), Day22=maxif(Present,Day==22), Day23=maxif(Present,Day==23), Day24=maxif(Present,Day==24), Day25=maxif(Present,Day==25), Day26=maxif(Present,Day==26), Day27=maxif(Present,Day==27), Day28=maxif(Present,Day==28), Day29=maxif(Present,Day==29), Day30=maxif(Present,Day==30), Day31=maxif(Present,Day==31) by UserId, DisplayName | extend MonthlyTally=Day1+Day2+Day3+Day4+Day5+Day6+Day7+Day8+Day9+Day10+Day11+Day12+Day13+Day14+Day15+Day16+Day17+Day18+Day19+Day20+Day21+Day22+Day23+Day24+Day25+Day26+Day27+Day28+Day29+Day30+Day31 | extend MonthStartDate = format_datetime(startTime,'yyyy-MM-dd');\\nlet idMap = BrivoEvents_CL | where TimeGenerated between (startTime .. endTime) | extend UserId = tostring(user_id_s) | summarize arg_max(TimeGenerated, empid_s, medeeid_s) by UserId | extend EmployeeNumber = iif(isnull(empid_s) and isnull(medeeid_s),'missing',substring(strcat('000000', tostring(coalesce(empid_s,medeeid_s))),-6,6));\\nlet identityLookup = IdentityInfo | where TimeGenerated > ago(90d) | extend EmployeeNumber = substring(strcat('000000', tostring(EmployeeId)),-6,6) | summarize arg_max(TimeGenerated, AccountUPN, AccountDisplayName) by EmployeeNumber;\\nwithTallies | join kind=leftouter (idMap) on UserId | join kind=leftouter (identityLookup) on EmployeeNumber | project Name=tolower(DisplayName), EmployeeNumber, Email=AccountUPN, MonthStartDate, MonthlyTally, Day1,Day2,Day3,Day4,Day5,Day6,Day7,Day8,Day9,Day10,Day11,Day12,Day13,Day14,Day15,Day16,Day17,Day18,Day19,Day20,Day21,Day22,Day23,Day24,Day25,Day26,Day27,Day28,Day29,Day30,Day31 | where not(EmployeeNumber has_any (ignoreids)) | where not(Name has_any (ignorenames)) | where not(Email has_any (ignoreemails)) | order by Name asc\",\"size\":0,\"title\":\"Badge Swipe Tally\",\"showExportToExcel\":true,\"queryType\":0,\"resourceType\":\"microsoft.operationalinsights/workspaces\",\"gridSettings\":{\"rowLimit\":3000}},\"name\":\"query - 3\"}],\"isLocked\":false,\"fallbackResourceIds\":[\"/subscriptions/<SUBSCRIPTION-ID>/resourcegroups/<RESOURCE-GROUP>/providers/microsoft.operationalinsights/workspaces/<WORKSPACE-NAME>\"],\"fromTemplateId\":\"sentinel-UserWorkbook\"}",
        "version": "1.0",
        "sourceId": "[parameters('workbookSourceId')]",
        "category": "[parameters('workbookType')]"
      }
    }
  ],
  "outputs": {
    "workbookId": {
      "type": "string",
      "value": "[resourceId('microsoft.insights/workbooks', parameters('workbookId'))]"
    }
  },
  "$schema": "http://schema.management.azure.com/schemas/2015-01-01/deploymentTemplate.json#"
}
